archives/2024/Results/Verifications/S2427/point_select/tidb-server-default.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 8512.78 qps: 8512.78 (r/w/o: 8512.78/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 8709.53 qps: 8709.53 (r/w/o: 8709.53/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 8921.60 qps: 8921.60 (r/w/o: 8921.60/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 7933.14 qps: 7933.14 (r/w/o: 7933.14/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 7230.05 qps: 7230.05 (r/w/o: 7230.05/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 6978.46 qps: 6978.46 (r/w/o: 6978.46/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 8448.45 qps: 8448.45 (r/w/o: 8448.45/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 8810.49 qps: 8810.49 (r/w/o: 8810.49/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 8753.04 qps: 8753.04 (r/w/o: 8753.04/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 8172.59 qps: 8172.59 (r/w/o: 8172.59/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 8996.72 qps: 8996.72 (r/w/o: 8996.72/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 8911.58 qps: 8911.58 (r/w/o: 8911.58/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 8891.59 qps: 8891.59 (r/w/o: 8891.59/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 8865.23 qps: 8865.23 (r/w/o: 8865.23/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 9058.35 qps: 9058.35 (r/w/o: 9058.35/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 8804.66 qps: 8804.66 (r/w/o: 8804.66/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 8643.22 qps: 8643.22 (r/w/o: 8643.22/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 9049.41 qps: 9049.41 (r/w/o: 9049.41/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 8838.66 qps: 8838.66 (r/w/o: 8838.66/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 8273.13 qps: 8273.13 (r/w/o: 8273.13/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 8096.96 qps: 8096.96 (r/w/o: 8096.96/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 9021.23 qps: 9021.33 (r/w/o: 9021.33/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 8837.69 qps: 8837.59 (r/w/o: 8837.59/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 8923.24 qps: 8923.24 (r/w/o: 8923.24/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 9015.43 qps: 9015.43 (r/w/o: 9015.43/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 8998.48 qps: 8998.48 (r/w/o: 8998.48/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 8808.76 qps: 8808.76 (r/w/o: 8808.76/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 8786.07 qps: 8786.07 (r/w/o: 8786.07/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 8984.89 qps: 8984.89 (r/w/o: 8984.89/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 8713.88 qps: 8713.88 (r/w/o: 8713.88/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 9007.95 qps: 9007.95 (r/w/o: 9007.95/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 8492.78 qps: 8492.78 (r/w/o: 8492.78/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 7698.60 qps: 7698.60 (r/w/o: 7698.60/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 8264.60 qps: 8264.70 (r/w/o: 8264.70/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 8953.90 qps: 8953.80 (r/w/o: 8953.80/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 8766.86 qps: 8766.86 (r/w/o: 8766.86/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 8974.77 qps: 8974.77 (r/w/o: 8974.77/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 8854.92 qps: 8854.92 (r/w/o: 8854.92/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 8882.55 qps: 8882.55 (r/w/o: 8882.55/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 8921.57 qps: 8921.57 (r/w/o: 8921.57/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 8857.50 qps: 8857.50 (r/w/o: 8857.50/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 9099.82 qps: 9099.82 (r/w/o: 9099.82/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 8511.67 qps: 8511.77 (r/w/o: 8511.77/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 8830.85 qps: 8830.85 (r/w/o: 8830.85/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 8089.70 qps: 8089.60 (r/w/o: 8089.60/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 7724.82 qps: 7724.82 (r/w/o: 7724.82/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 8313.59 qps: 8313.59 (r/w/o: 8313.59/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 8979.63 qps: 8979.63 (r/w/o: 8979.63/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 8924.48 qps: 8924.48 (r/w/o: 8924.48/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 9075.25 qps: 9075.25 (r/w/o: 9075.25/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 8855.87 qps: 8855.87 (r/w/o: 8855.87/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 9076.89 qps: 9076.89 (r/w/o: 9076.89/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 8870.29 qps: 8870.29 (r/w/o: 8870.29/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 8947.31 qps: 8947.31 (r/w/o: 8947.31/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 9093.62 qps: 9093.62 (r/w/o: 9093.62/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 8861.68 qps: 8861.68 (r/w/o: 8861.68/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 8793.87 qps: 8793.87 (r/w/o: 8793.87/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 8379.28 qps: 8379.28 (r/w/o: 8379.28/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 8932.89 qps: 8932.89 (r/w/o: 8932.89/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5204667
        write:                           0
        other:                           0
        total:                           5204667
    transactions:                        5204667 (8674.30 per sec.)
    queries:                             5204667 (8674.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0058s
    total number of events:              5204667

Latency (ms):
         min:                                    0.64
         avg:                                    1.38
         max:                                  303.12
         95th percentile:                        2.61
         sum:                              7188987.94

Threads fairness:
    events (avg/stddev):           433722.2500/677.43
    execution time (avg/stddev):   599.0823/0.03